In [16]:
import sqlite3
import pandas as pd
import pandasql

In [17]:
bank_account_data = pd.read_excel('bank_account_data.xlsx', sheet_name='Mortgage')

In [18]:
type(bank_account_data)

pandas.core.frame.DataFrame

In [19]:
bank_account_data.head()

   Cust_ID  Purchase  Cheq_Bal   Sav_Bal  Debt_Bal  Joint_Acct  Age       Date
0        1         0   1739.48  26918.18  12563.93           0   49        NaT
1        2         0   2862.35  23093.67  15457.88           0   39        NaT
2        3         0   2296.66  18037.33  12721.89           0   52        NaT
3        4         1   2880.28  32317.63   7075.03           0   28 2017-04-30
4        5         0    998.27  15110.04  11356.13           0   43        NaT

In [20]:
bank_account_data.columns

Index(['Cust_ID', 'Purchase', 'Cheq_Bal', 'Sav_Bal', 'Debt_Bal', 'Joint_Acct',
       'Age', 'Date'],
      dtype='object')

In [21]:
Purchase_sql= pandasql.sqldf("""
    SELECT 
    AVG(Purchase),MAX(Purchase), MIN(Purchase), SUM(Purchase), COUNT(Purchase)
    FROM bank_account_data;""")
Purchase_sql

   AVG(Purchase)  MAX(Purchase)  MIN(Purchase)  SUM(Purchase)  COUNT(Purchase)
0          0.195              1              0             39              200

In [22]:
Cheq_Bal_sql= pandasql.sqldf("""
    SELECT AVG(Cheq_Bal), MAX(Cheq_Bal), MIN(Cheq_Bal), SUM(Cheq_Bal), COUNT(Cheq_Bal)
    FROM bank_account_data;""")
Cheq_Bal_sql

   AVG(Cheq_Bal)  MAX(Cheq_Bal)  MIN(Cheq_Bal)  SUM(Cheq_Bal)  COUNT(Cheq_Bal)
0      2145.0935        4437.44         644.31       429018.7              200

In [23]:
Sav_Bal_sql= pandasql.sqldf("""
    SELECT AVG(Sav_Bal), MAX(Sav_Bal), MIN(Sav_Bal), SUM(Sav_Bal), COUNT(Sav_Bal)
    FROM bank_account_data;""")
Sav_Bal_sql

   AVG(Sav_Bal)  MAX(Sav_Bal)  MIN(Sav_Bal)  SUM(Sav_Bal)  COUNT(Sav_Bal)
0   22084.42895      39132.63       6558.91    4416885.79             200

In [24]:
Debt_Bal_sql= pandasql.sqldf("""
    SELECT AVG(Debt_Bal), MAX(Debt_Bal), MIN(Debt_Bal), SUM(Debt_Bal), COUNT(Debt_Bal)
    FROM bank_account_data;""")
Debt_Bal_sql

   AVG(Debt_Bal)  MAX(Debt_Bal)  MIN(Debt_Bal)  SUM(Debt_Bal)  COUNT(Debt_Bal)
0      8638.3696        20559.7            0.0     1727673.92              200

In [25]:
Joint_Acct_sql= pandasql.sqldf("""
    SELECT AVG(Joint_Acct), MAX(Joint_Acct), MIN(Joint_Acct), SUM(Joint_Acct), COUNT(Joint_Acct)
    FROM bank_account_data;""")
Joint_Acct_sql

,AVG(Joint_Acct),MAX(Joint_Acct),MIN(Joint_Acct),SUM(Joint_Acct),COUNT(Joint_Acct)
0,0.295,1,0,59,200

In [26]:
Age_sql= pandasql.sqldf("""
    SELECT AVG(Age), MAX(Age), MIN(Age), SUM(Age), COUNT(Age)
    FROM bank_account_data;""")
Age_sql

   AVG(Age)  MAX(Age)  MIN(Age)  SUM(Age)  COUNT(Age)
0    38.535        60        18      7707         200

In [27]:
Date_sql= pandasql.sqldf("""
    SELECT AVG(Date), MAX(Date), MIN(Date), COUNT(Date)
    FROM bank_account_data;""")
Date_sql

,AVG(Date),MAX(Date),MIN(Date),COUNT(Date)
0,2017.0,2017-08-29 00:00:00.000000,2017-04-01 00:00:00.000000,39

In [28]:
bank_account_data

,Cust_ID,Purchase,Cheq_Bal,Sav_Bal,Debt_Bal,Joint_Acct,Age,Date
0,1,0,1739.48,26918.18,12563.93,0,49,NaT
1,2,0,2862.35,23093.67,15457.88,0,39,NaT
2,3,0,2296.66,18037.33,12721.89,0,52,NaT
3,4,1,2880.28,32317.63,7075.03,0,28,2017-04-30
4,5,0,998.27,15110.04,11356.13,0,43,NaT
...,...,...,...,...,...,...,...,...
195,196,0,2215.39,20050.87,11307.01,0,32,NaT
196,197,0,2074.33,22808.68,7880.16,0,27,NaT
197,198,0,1224.07,29926.97,5637.92,0,44,NaT
198,199,0,2617.27,14316.61,9445.28,0,38,NaT
199,200,0,2125.45,25687.52,4559.63,0,56,NaT

In [29]:
Bal_SUM= pandasql.sqldf("""
    SELECT 
        SUM(Cheq_Bal + Sav_Bal +Debt_Bal) as "Общая сумма счетов пользователя"
    FROM bank_account_data 
    GROUP BY Cust_ID;""")
Bal_SUM.head()

   Общая сумма счетов пользователя
0                         41221.59
1                         41413.90
2                         33055.88
3                         42272.94
4                         27464.44

In [30]:
Bal_SUM= pandasql.sqldf("""
    SELECT 
        SUM(Cheq_Bal + Sav_Bal +Debt_Bal) as "Общая сумма на счетах ипотечников" 
    FROM bank_account_data 
    WHERE Purchase=1 
    GROUP BY Cust_ID;""")
Bal_SUM.head()

   Общая сумма на счетах ипотечников
0                           42272.94
1                           41838.28
2                           29915.27
3                           38132.88
4                           28965.99

In [31]:
Bal_SUM_0= pandasql.sqldf(""" 
    SELECT 
        AVG(Cheq_Bal + Sav_Bal +Debt_Bal) as "Среднее суммы счетов без ипотки" 
    FROM bank_account_data
    WHERE Purchase=0;""")
Bal_SUM_0

   Среднее суммы счетов без ипотки
0                     32095.885031

In [32]:
Bal_SUM_1= pandasql.sqldf("""
    SELECT 
        AVG(Cheq_Bal + Sav_Bal +Debt_Bal) as "Среднее суммы счетов с ипотекой" 
    FROM bank_account_data 
    WHERE Purchase=1;""")
Bal_SUM_1

   Среднее суммы счетов с ипотекой
0                     36054.895385

In [33]:
Bal_AVG_1= pandasql.sqldf("""
    SELECT 
        AVG(Cheq_Bal), AVG(Sav_Bal), AVG (Debt_Bal)
    FROM bank_account_data 
    WHERE Purchase=1;""")
Bal_AVG_1

   AVG(Cheq_Bal)  AVG(Sav_Bal)  AVG (Debt_Bal)
0    2757.975641  29627.564359     3669.355385

In [34]:
Bal_AVG_0= pandasql.sqldf("""
    SELECT 
        AVG(Cheq_Bal), AVG(Sav_Bal), AVG (Debt_Bal)
    FROM bank_account_data 
    WHERE Purchase=0;""")
Bal_AVG_0

   AVG(Cheq_Bal)  AVG(Sav_Bal)  AVG (Debt_Bal)
0    1996.631366  20257.209814     9842.043851

Строка: 0 - без ипотеки, 1 - с ипотекой. Разница есть: люди с ипотекой имеют на Cheq_Bal & Sav_Bal больший счет.

In [35]:
pd.concat([Bal_AVG_0, Bal_AVG_1], ignore_index=True, axis=0)

   AVG(Cheq_Bal)  AVG(Sav_Bal)  AVG (Debt_Bal)
0    1996.631366  20257.209814     9842.043851
1    2757.975641  29627.564359     3669.355385

Самый возрастной получатель Ипотеки с ID=41, ему 45 лет.

In [36]:
Age_max= pandasql.sqldf("""
    SELECT * 
    FROM 
        bank_account_data
    WHERE
        Purchase=1
        AND Age = (SELECT MAX(Age) FROM bank_account_data WHERE Purchase=1);""")
Age_max

,Cust_ID,Purchase,Cheq_Bal,Sav_Bal,Debt_Bal,Joint_Acct,Age,Date
0,41,1,3615.8,24983.76,5663.16,0,45,2017-08-25 00:00:00.000000

Раньше всех получил ипотеку клиент с ID = 185, с датой = 2017-04-01

In [37]:
Date_min= pandasql.sqldf(""" 
    SELECT * 
    FROM 
        bank_account_data 
    WHERE
        Purchase=1
        AND Date = (SELECT MIN(Date) FROM bank_account_data WHERE Purchase=1) ;""")
Date_min

,Cust_ID,Purchase,Cheq_Bal,Sav_Bal,Debt_Bal,Joint_Acct,Age,Date
0,185,1,1759.04,29198.17,3285.39,1,36,2017-04-01 00:00:00.000000

    Создайте любую базу данных в sqlite3, состоящую из 5 колонок, одна из колонок обязательно должна быть типа REAL. (Названия колонок любые, какие захотите)

In [38]:
import sqlite3

New_db = sqlite3.connect('New_db.db')
print("Opened database successfully");

New_db.execute('''
CREATE TABLE IF NOT EXISTS Cardial_disease (
ID INTEGER, 
SEX STRING,
AGE INTEGER, 
SYS_HYP INTEGER,
DIA_HYP INTEGER,  
CHOLESTEROL REAL);''')

New_db.commit()

print("Table created successfully");
New_db.close()

Opened database successfully
Table created successfully

In [39]:
New_db

In [40]:
# INSERTING VALUES
New_db = sqlite3.connect('New_db.db')

New_db.execute("""
INSERT INTO Cardial_disease VALUES
('1', 'Male', '55', '140', '90', '6.2'),
(2, 'Female', 45, 150, 100, 5.8),
(3, 'Female', 60, 130, 110, 7.0);""")

New_db.commit()
New_db.close()

In [41]:
New_db = sqlite3.connect('New_db.db')
cur = New_db.cursor()
cur.execute("SELECT * from Cardial_disease;")
result = cur.fetchall()
New_db.close()

In [42]:
result

[(1, 'Male', 55, 140, 90, 6.2),
 (2, 'Female', 45, 150, 100, 5.8),
 (3, 'Female', 60, 130, 110, 7.0)]

In [43]:
# DELETING VALUES
New_db = sqlite3.connect('New_db.db')

New_db.execute("""
    DELETE
    FROM Cardial_disease 
    WHERE CHOLESTEROL < (SELECT MAX(CHOLESTEROL) FROM Cardial_disease)
    AND CHOLESTEROL > (SELECT MIN(CHOLESTEROL) FROM Cardial_disease);""")

New_db.commit()
New_db.close()

In [44]:
New_db = sqlite3.connect('New_db.db')
cur = New_db.cursor()
cur.execute("SELECT * from Cardial_disease;")
result = cur.fetchall()
New_db.close()

In [48]:
result

[(2, 'Female', 45, 150, 100, 5.8), (3, 'Female', 60, 130, 110, 7.0)]

In [46]:
# Delete ALL VALUES FROM New_db
New_db = sqlite3.connect('New_db.db')

New_db.execute("DELETE FROM Cardial_disease;")

New_db.commit()
New_db.close()